export default function EscapePage() {
  return (
    <main className="min-h-screen bg-black text-neutral-100 px-8 py-20">
      <div className="max-w-3xl mx-auto">

        <a
          href="/archive"
          className="text-neutral-500 hover:text-white transition-colors text-sm"
        >
          ← 返回目录
        </a>

        <div className="mt-16 mb-20">
          <p className="text-neutral-500 tracking-[0.4em] uppercase text-xs mb-6">
            SHORT STORY
          </p>

          <h1 className="text-5xl md:text-7xl font-light leading-tight mb-8">
            边界与留下
          </h1>

          <div className="w-20 h-px bg-neutral-700 mb-8" />

          <p className="text-neutral-400 text-lg leading-8">
            向笛第一次要求进她房间要敲门时，温岭正在厨房切西红柿。
          </p>
        </div>

        <div className="text-[17px] leading-10 text-neutral-300 whitespace-pre-wrap">
{`
向笛第一次要求进她房间要敲门时，温岭正在厨房切西红柿。
“怎么了？”听见拖鞋的啪嗒啪嗒声，温岭没有抬头，他刚把蛋清搅拌好。
“你能不能别老是有事没事就进我房间？”
这已经不是一次两次了。
她最近工作很忙，整晚整晚都在修改项目方案，甲方那边催的很急，她已经熬了好几个大夜了。
但温岭却像是根本没注意到一样，还是一洗完澡就往她房间里钻。
“我很烦。”
温岭拿着菜刀的手停住了，然后又像是什么都没听到一样接着切了下去。
番茄的汁水爆了出来，喷到了他的下巴上，他拿手背擦了擦。
“”温岭你听到没？我真的说过很多遍了，我最近很忙，我想一个人待着。”温岭一直没反应，向笛已经有点不耐烦了。
“可是你已经好久没和我一起出去约会了。”
温岭放下菜刀，转过身看向温岭。
他比温岭高一个头，因此温岭和他说话总要仰着。
“你的手机也改了密码”，温岭擦了擦手，拉着向笛坐到了沙发上。
“什么？你还偷看我手机？”向笛有些不可置信。
“你以前自己把密码告诉我的，还说手机电脑都随便我看的不是吗”温岭有些受伤。
“你先告诉我，你什么时候翻我手机的”向笛觉得这事不能这么轻易糊弄过去。
“就，你洗澡的时候……”温岭的眼睛不自然的飘向了远处，那是他们去年情人节一起去景德镇玩时带回来的花瓶，他俩一起做的，虽然做的不好看，但温岭很喜欢，还在上面画了代表他俩的小人。
向笛觉得有些好笑，自己原来和温岭在一起是因为他听话懂事，但是不知道什么时候开始，他越来越没有分寸感了。
“我没有看到，我只是”
“好了，算了，你不要解释了”向笛头很痛，本来公司最近加班就多，“就先这样吧，我们先分开待一段时间。”
“小笛……”
回应温岭的，是向笛甩上的房门声。

“咚咚咚”
“怎么了？”向笛揉了揉山根，把眼镜摘了下来，“你自己进来吧”
“我就不进了，我是说饭菜做好了，可以来吃了。”温岭的声音从门后隐隐约约的传了过来。
向笛把电脑合上，走出了房间。

饭桌上很安静，向笛忽然有点不习惯。
以前温岭很喜欢和她分享最近的生活趣事的，即使是路边遇到了一条狗他都会拿出来讲。
“最近篮球社在忙什么？”向笛夹了一块番茄到碗里。
鸡蛋好像有点焦了。
向笛不自觉的想着。
“小笛，你是不是不喜欢我了……”温岭没有回答她的问题，反而反问道。
“怎么会这么想？” 
可不等他回答，向笛快速地扒干净饭，拿纸巾擦了擦嘴，起身向房间走去，“我最近太忙了，这周的碗你先洗，下周我补回来。”
温岭在饭桌上坐着，久久没有动。

接下来的一段时间，温岭果然安分了许多，没有再动不动就闯进她的房间。
甚至就算在家他也安安静静的，不像以前那样不是看球赛就是打游戏。
向笛长舒了口气，继续忙方案。
她知道，这只是假象，等她忙完这段时间，温岭又会重蹈覆辙。
当放下电脑，看着窗外的夜景时，她忽然想起过去。

她比温岭大十岁，刚在一起的时候她总在想这样是不是不太好。
他们年龄差太多了，她成年的时候，他还在上小学。
父母不知道她谈了个小她十岁的男生，最近还一直在给她推各种相亲对象的微信。
她是长得显年轻，可是年龄差毕竟摆在那里，和他一起出去的时候，没有一个人会觉得他们是情侣。
他们都觉得她是他姐姐，甚至还有女生因为不好意思直接问他要电话号转而向她要的。
他一直想要带她去见他父母，说他父母很开明，不会在意这些的，可是她总是找找各种理由推脱。

他们真的合适吗？
这段时间她一直在想这个问题。

而且更重要的一点是温岭太黏人了。不知道是不是小时候缺爱，他离不得她。
出差要和他24小时报备，每天都要和他打视频电话，不接的话就会短信轰炸直到她终于有空接为止，上次她说两个人住一个房间让她觉得很没有隐私要分房睡的时候，他闹了好久。
以往的男友都是和她差不多年纪的同龄人，彼此会尊重对方，给对方留一个私密的空间，但温岭好像对这方面一点概念都没有。
她真的觉得有点窒息。
他贴的太近了，近到她喘不过气。
她不喜欢这种感觉，不能因为另外一个人就失去了她自己。
他们之间的阻力已经足够多了。
如果温岭还要继续和她在一起的话，就必须学会接受这一点。

向笛洗了把脸，走出了房间。
“温岭，我们谈谈。”
`}
        </div>

      </div>
    </main>
  )
}