export default function EscapePage() {
  return (
    <main className="min-h-screen bg-black text-neutral-100 px-8 py-20">
      <div className="max-w-3xl mx-auto">

        <a
          href="/archive"
          className="text-neutral-500 hover:text-white transition-colors text-sm"
        >
          ← 返回目录
        </a>

        <div className="mt-16 mb-20">
          <p className="text-neutral-500 tracking-[0.4em] uppercase text-xs mb-6">
            SHORT STORY
          </p>

          <h1 className="text-5xl md:text-7xl font-light leading-tight mb-8">
            无尽逃亡
          </h1>

          <div className="w-20 h-px bg-neutral-700 mb-8" />

          <p className="text-neutral-400 text-lg leading-8">
            凌晨四点的鸟叫。
          </p>
        </div>

        <div className="text-[17px] leading-10 text-neutral-300 whitespace-pre-wrap">
{`
天上的乌云压得很低很低，窗外的风咆哮着，吼叫着，似乎要席卷一切。
“小涵，吃饭啦。”李莉把最后一道菜端上桌，将手上的水在围裙上擦了擦，解下围裙挂在了挂钩上。
“哇，是小涵最喜欢的麻辣小龙虾！”小涵开心的两眼放光，窗外的风吹了进来，把她的双马尾吹得一甩一甩的。
“来，妈妈帮你剥壳。”李莉坐到了小涵旁边，戴上一次性手套耐心的剥着壳。
小涵目不转睛的盯着前方，平板上放着小涵最喜欢的小马宝莉。
“时间就像河流，再微小的事都能改变全局。”紫色的小马紫悦正眨着她那大大的眼睛用甜美的声音说道。
“妈妈边剥，小涵边吃好吗，要不饭菜要凉了。”李莉劝道。
“好……”小涵拿起筷子，慢吞吞的扒拉饭。
小涵边看动画片边吃，吃的很慢，眼神就跟被粘住了一样，离不开屏幕一点。
“小涵乖，好好吃饭。”李莉把小涵的脑袋掰向她这边。
小涵撇了撇嘴没有说话，眼睛直勾勾的看着她，看起来很不高兴。
“妈妈喂你好不好？”
小涵还是不做声。
李莉知道劝不动小涵，于是沉默着放开手，让她继续看。她拿起自己的饭碗，陪她一起吃。
动画很快放完了一集，小涵碗里的饭还是没怎么动，李莉也不多说，给小涵擦了擦嘴，把碗筷收拾好。
家里有零食，饿了孩子自己会去吃。

雨飘进窗户，有雨滴顺着风飘落在了小涵脸上。
等李莉洗完碗回来一看，小涵还在看电视，李莉有些生气，把平板收起来不让她看了。
小涵眼泪汪汪。
“妈妈看看都几点了，都快九点了，你还在这里看电视，明天还要不要起床了。”李莉抱起小涵，装作要打她的屁股似的轻轻拍了几下。
小涵乖乖的赖在她怀里。
“小涵听话，妈妈明天给你买新衣服，小涵老是不好好吃饭，连个子都不长，叫妈妈怎么放心。”
李莉把小涵抱到床上，给她换上睡衣。
“抬手小涵”小涵睁着大大的眼睛，萌萌地看着她，但就是不照做。
李莉无奈的帮她抬手，把袖子套进去，把衣角塞好。
“好啦，衣服换好啦，现在，听妈妈的话，好好睡觉”小涵在床上躺好了，李莉把被子给她盖好，随后也钻进了被子里。
“小涵怎么还睁着眼睛呀，在想什么？”
“在想，小涵最喜欢妈妈了，小涵要一辈子都和妈妈在一起”
李莉勾起嘴角笑得很开心，“mua”李莉低头在小涵脸上狠狠地亲了一口，然后帮她闭上了眼睛。
“好好睡，妈妈会一直陪着小涵的，妈妈也最爱小涵了”李莉抱着小涵有些发冷的手脚，甜甜地进入了梦乡。

窗外的雨不知何时停了。
风吹动窗帘，书桌上的一张沾满灰尘的纸被吹落到地上。
月光冷冷的照在上面。
这是一则寻人启事，上面写着：
寻找爱女 赵涵
姓名：赵涵 性别：女
出生时间：2013年4月18日
失踪时间：2018年7月6日
失踪地点：谜图省黎嘉市陌路区
特征描述：右脸脸颊中间有一颗痣。放学时和孩子爸爸搭乘公交时走失，失踪时扎着双马尾，还望看见的好心人及时与我们联系，必有重金答谢！
联系电话：159xxxxxxxx
`}
        </div>

      </div>
    </main>
  )
}